{
  "workexp": [
    {
      "company": "Coding Ninjas",
      "location": "Delhi",
      "role": "Technical Content Writer Intern",
      "start": "Sept 2022",
      "end": "Dec 2022",
      "points": [
        "Consistently delivered 3 blogs a week with minimal delays, writing an average of 1.8k words per blog, along with illustrative images and diagrams.",
        "Researched and wrote articles on topics such as Akamai, AWS, test automation tools such as Katalon and ReadyAPI, etc.",
        "Worked with software such as AWS, Postman,Puppet, etc. - installing and writing code for them in order to write tutorial articles about them."
      ]
    },
    {
      "company": "IIT-Delhi",
      "location": "Delhi",
      "role": "App Developer Intern",
      "start": "Dec 2021",
      "end": "March 2022",
      "techstack": ["Flutter", "SQLite", "Arduino"],
      "points": [
        "Single-handedly designed and authored an Android app using Flutter SDK. The application receives, stores, displays and exports ECG data received from Arduino-based hardware. ",
        "The app utilizes SQLite as a local database and hashes the user's pin code using SHA-256."
      ]
    },
    {
      "company": "CRIS, Ministry of Railways",
      "location": "Delhi",
      "role": "Flutter Developer Intern",
      "techstack": ["Flutter"],
      "start": "Aug 2021",
      "end": "Oct 2021",
      "points": [
        "Created the structural layout for multilingual support in the app. The app currently supports 2 languages, extendible to any number without any programming effort.",
        "Pushed for and assisted in migration to null-safe version of Flutter, resulting in a 40% drop in compile time and a 30% drop in startup time, with many other noticeable performance improvements."
      ]
    }
  ],
  "projects": [
    {
      "name:": "DTU-DCE Fraternity Forum",
      "techstack": ["Flutter", "JWT", "REST"],
      "links": [
        {
          "name": "DTU-DCE Fraternity Forum",
          "url": "https://dtudcefraternity.org/"
        },
        {
          "name": "App Store",
          "url": "https://apps.apple.com/in/app/dtu-dce-fraternity-forum/id1601864796"
        },
        {
          "name": "Play Store",
          "url": "https://play.google.com/store/apps/details?id=org.dtudcefraternity.mobile.app"
        }
      ],
      "shortDescription":"Headed the development of the mobile app for the forum. Worked closely with the President of the Forum, and led a team of 3 developers to develop and launch the app.",
      "points": [
        "Directed a team of 3 developers and architected, developed and coded an app for DTU-DCE Fraternity Forum from scratch using Flutter, with full integration with REST API with server.",
        "Co-ordinated with backend team to develop and test new API endpoints. Also coordinated with Resume partner Resumod, who provide free membership of Resumod to forum members.",
        "Integrated authentication support with JWT authentication tokens for registered users. ",
        "Built an admin panel into the app for the administrators to alter membership statuses and view user data.",
        "The app has 100+ downloads on Play Store, with a rating of 5 on both the Play Store and App Store."
      ],
      "image":"./images/projects/dtu_dce_frat.png"
    }
  ],
  "achievements": [
    "Secured rank 3989 in TCS CodeVita Season 10, out of 100k + participants",
    "Secured rank 1421 in Newton School's Grand Coding Contest 2022, out of roughly 12k participants",
    "Secured All India Rank 5045 in JEE Mains 2020",
    "Cleared KVPY SA (11th) First Round in 2018"
  ],
  "skills": [
    "Flutter",
    "Dart",
    "C++",
    "Java",
    "JavaScript",
    "Node.js",
    "Express.js",
    "SQL",
    "MongoDB",
    "Git",
    "Firebase"
  ],
  "pors": [
    {
      "name:": "TEDxDTU",
      "role": "Head of Tech Team",
      "techstack": [
        "Flutter",
        "Firebase Auth",
        "Firestore",
        "MongoDB",
        "Mongoose",
        "AWS",
        "GCP"
      ],
      "start": "Dec 2021",
      "end": "Present",
      "links": [
        {
          "name": "Github-App",
          "url": "https://github.com/TEDxDTU/FlutterApp"
        },
        {
          "name": "Github-Web",
          "url": "https://github.com/TEDxDTU/Web"
        },
        {
          "name":"Website",
          "url":"https://tedxdtu.in/"
        },
        {"name":"Play Store",
        "url":"ADDLINKHERE"
      }
      ],
      "points": [
        "Led the development of the mobile app in Flutter, and oversaw the development of the Website in Next.js",
        "Contributed extensively to the backend code in Node.js",
        "Set up AWS EC2 as a server for hosting the website, and configured SSL certificates for the domain using Let's Encrypt, and moved the live website to GCP Compute Engine to scale it. Used nginx as a reverse proxy to route requests to the Node.js code.",
        "The website served 400,000 HTTP requests, had 8k unique IP addresses making requests, and 1.5k registered users in a span of 20 days. 2/3rds of the tickets for the event were sold on the website"
      ]
    }
  ]
}
